def lookup_key(data: dict, value) -> list:

    res = []
    for key, items in data.items():
        if items == value:
            res.append(key)
    
    print(type(res))
    
    return res


print(lookup_key({'F': 1, 'FX': 2, 'E': 3, 'D': 3, 'C': 4, 'B': 5, 'A': 5}, 5))



'''
Як ми знаємо, ключ у словнику має бути унікальним, тоді як значення його ні.
Реалізуйте функцію lookup_key для пошуку всіх ключів за значенням у словнику. Першим параметром у функцію ми передаємо словник,
а другим — значення, що хочемо знайти. Таким чином, результат може бути як список ключів, так і порожній список, якщо ми нічого не знайдемо.
'''